Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ32MC102.h
#define ALTI2C_ON            0xFFFB
#define ALTI2C_OFF           0xFFFF

#define LPOL_OFF             0xFFF7
#define LPOL_ON              0xFFFF

#define IOL1WAY_OFF          0xFFEF
#define IOL1WAY_ON           0xFFFF

#define OSCIOFNC_ON          0xFFDF
#define OSCIOFNC_OFF         0xFFFF

#define FCKSM_CSECME         0xFF3F
#define FCKSM_CSECMD         0xFF7F
#define FCKSM_CSDCMD         0xFFBF

#define FNOSC_FRC            0xF8FF
#define FNOSC_FRCPLL         0xF9FF
#define FNOSC_PRI            0xFAFF
#define FNOSC_PRIPLL         0xFBFF
#define FNOSC_SOSC           0xFCFF
#define FNOSC_LPRC           0xFDFF
#define FNOSC_FRCDIVN        0xFFFF

#define WDTWIN_WDTWIN75      0xE7FF
#define WDTWIN_WDTWIN50      0xEFFF
#define WDTWIN_WDTWIN37      0xF7FF
#define WDTWIN_WDTWIN25      0xFFFF

#define PWMPIN_OFF           0xDFFF
#define PWMPIN_ON            0xFFFF

#define PWMLOCK_OFF          0xBFFF
#define PWMLOCK_ON           0xFFFF

#define IESO_OFF             0x7FFF
#define IESO_ON              0xFFFF

/* Register CONFIG1 (0x57fe)                               */

extern __attribute__((space(prog))) unsigned int _CONFIG1;
#define _CONFIG1(x) __attribute__((section("__CONFIG1.sec"),space(prog))) unsigned int _CONFIG1 = (x);

/*
** Only one invocation of CONFIG1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG1.
** Multiple options may be combined, as shown:
**
** _CONFIG1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Watchdog Timer Postscaler:
**     WDTPOST_PS1          1:1
**     WDTPOST_PS2          1:2
**     WDTPOST_PS4          1:4
**     WDTPOST_PS8          1:8
**     WDTPOST_PS16         1:16
**     WDTPOST_PS32         1:32
**     WDTPOST_PS64         1:64
**     WDTPOST_PS128        1:128
**     WDTPOST_PS256        1:256
**     WDTPOST_PS512        1:512
**     WDTPOST_PS1024       1:1,024
**     WDTPOST_PS2048       1:2,048
**     WDTPOST_PS4096       1:4,096
**     WDTPOST_PS8192       1:8,192
**     WDTPOST_PS16384      1:16,384
**     WDTPOST_PS32768      1:32,768
**
**   WDT Prescaler:
**     WDTPRE_PR32          Prescaler ratio of 1:32
**     WDTPRE_PR128         Prescaler ratio of 1:128
**
**   PLL Lock Enable:
**     PLLKEN_OFF           Clock switch will not wait for the PLL lock signal.
**     PLLKEN_ON            Clock switch to PLL source will wait until the PLL lock signal is valid.
**
**   Watchdog Timer Window:
**     WINDIS_ON            Watchdog Timer in Window mode
**     WINDIS_OFF           Watchdog Timer in Non-Window mode
**
**   Watchdog Timer Enable:
**     FWDTEN_OFF           Watchdog timer enabled/disabled by user software
**     FWDTEN_ON            Watchdog timer always enabled
**
**   Comm Channel Select:
**     ICS_PGD3             Communicate on PGEC3/PGED3
**     ICS_PGD2             Communicate on PGEC2/PGED2
**     ICS_PGD1             Communicate on PGEC1/PGED1
**
**   Motor Control PWM High Side Polarity bit:
**     HPOL_OFF             PWM module high side output pins have active-low output polarity
**     HPOL_ON              PWM module high side output pins have active-high output polarity
**
**   General Code Segment Write Protect:
**     GWRP_ON              Writes to program memory are disabled
**     GWRP_OFF             Writes to program memory are allowed
**
**   General Segment Code Protection:
**     GCP_ON               Standard Security Code protection Enabled
**     GCP_OFF              General Segment Code protect is disabled
**
*/

#define WDTPOST_PS1          0x7FF0
#define WDTPOST_PS2          0x7FF1
#define WDTPOST_PS4          0x7FF2
#define WDTPOST_PS8          0x7FF3
#define WDTPOST_PS16         0x7FF4
#define WDTPOST_PS32         0x7FF5
#define WDTPOST_PS64         0x7FF6
#define WDTPOST_PS128        0x7FF7
#define WDTPOST_PS256        0x7FF8
#define WDTPOST_PS512        0x7FF9
#define WDTPOST_PS1024       0x7FFA
#define WDTPOST_PS2048       0x7FFB
#define WDTPOST_PS4096       0x7FFC
#define WDTPOST_PS8192       0x7FFD
#define WDTPOST_PS16384      0x7FFE
#define WDTPOST_PS32768      0x7FFF

#define WDTPRE_PR32          0x7FEF
#define WDTPRE_PR128         0x7FFF

#define PLLKEN_OFF           0x7FDF
#define PLLKEN_ON            0x7FFF

#define WINDIS_ON            0x7FBF
#define WINDIS_OFF           0x7FFF

#define FWDTEN_OFF           0x7F7F
#define FWDTEN_ON            0x7FFF

#define ICS_PGD3             0x7DFF
#define ICS_PGD2             0x7EFF
#define ICS_PGD1             0x7FFF

#define HPOL_OFF             0x7BFF
#define HPOL_ON              0x7FFF

#define GWRP_ON              0x6FFF
#define GWRP_OFF             0x7FFF

#define GCP_ON               0x5FFF
#define GCP_OFF              0x7FFF



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x55fc

#define __CONFIG2_BASE 0x57fc
#define __CONFIG2_LENGTH 0x2

#define __CONFIG1_BASE 0x57fe
#define __CONFIG1_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x400


#endif
